---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.GetFamilyName
source: html/bbab76a2-98c3-e6d3-c8b2-829ebd5e45e5.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.GetFamilyName Method

Gets the name of the element assigned to the current export state.

## Syntax (C#)
```csharp
public string GetFamilyName()
```

## Returns
The family name.

## Remarks
The family name is prepared for use in IFC output during the call to PushExportState().